/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalpha.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ari <ari@student.42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/21 15:32:01 by ari               #+#    #+#             */
/*   Updated: 2024/09/22 14:57:07 by ari              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


int ft_isalpha(int c) 
{
    if((c <= 'A' && >= 'z') || (c <= 'a' && >= 'z') {
        return 1;
    }

    return 0;
}

// La función devuelve un valor distinto de cero si el caracter
// pasa el parámetro.